In [2]:
import pandas as pd 
import sklearn.linear_model as sk
import matplotlib.pyplot as plt 
from word2number import w2n

In [6]:
pip install word2number

Collecting word2number
  Downloading word2number-1.1.zip (9.7 kB)
Using legacy 'setup.py install' for word2number, since package 'wheel' is not installed.
Installing collected packages: word2number
    Running setup.py install for word2number ... done
Successfully installed word2number-1.1
Note: you may need to restart the kernel to use updated packages.

In [5]:
data = pd.read_csv("datasets/hiring.csv")
data.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [6]:
#Fill NaN with a valid value and also change the text to numbers
# 
data.experience = data.experience.fillna("zero")
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [7]:
data.experience = data.experience.apply(w2n.word_to_num)
data

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [8]:
import math
median_test_score = math.floor(data['test_score(out of 10)'].mean())
median_test_score

7

In [9]:
data['test_score(out of 10)'] = data['test_score(out of 10)'].fillna(median_test_score)
data

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

In [10]:
reg = sk.LinearRegression()
reg.fit(data[['experience','test_score(out of 10)','interview_score(out of 10)']],data['salary($)'])

LinearRegression()

In [11]:
reg.predict([[2,9,6]])

array([53713.86677124])

In [12]:
reg.predict([[12,10,10]])

array([93747.79628651])